ProvisioningTemplates/263SGO_InitialSale_MI.txt

<soapenv:Envelope
    xmlns:soapenv = "http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ord = "http://soa.talktalk.net/OrderEntryServices"
    xmlns:add = "http://xmlns.talktalkplc.com/schema/CDM/Address"
    xmlns:card = "http://xmlns.talktalkplc.com/schema/CDM/Card"
    xmlns:ead = "http://xmlns.talktalkplc.com/schema/CDM/EAddress"
    xmlns:tel = "http://xmlns.talktalkplc.com/schema/CDM/TeleNumber">
    <soapenv:Header/>
    <soapenv:Body>
        <ord:SubmitGatewayOrderInputRequest>
            <ord:sourceChannel>TALKTALK SALES SITE</ord:sourceChannel>
            <ord:GatewayOrder>
                <ord:orderType>PROVIDE PACKAGE</ord:orderType>
                <ord:orderPlacementDate>M_DATETIME</ord:orderPlacementDate>
                <ord:customerRequiredDate>M_DATE</ord:customerRequiredDate>
                <ord:branchId>5625</ord:branchId>
                <ord:activityId>3</ord:activityId>
                <ord:brandId>TALKTALK</ord:brandId>
                <ord:exchangeCode>EMKINGS</ord:exchangeCode>
                <ord:sourceChannel>TALKTALK SALES SITE</ord:sourceChannel>
                <ord:primaryStbProductId>1</ord:primaryStbProductId>
                <ord:installationMethod>MANAGED INSTALL</ord:installationMethod>
                <ord:OriginatingAgent>
                    <ord:originatingAgentId>456789</ord:originatingAgentId>
                    <ord:originatingAgentType>0</ord:originatingAgentType>
                </ord:OriginatingAgent>
                <ord:Resources>
                    <ord:Resource>
                        <ord:resourceId>M_CLI</ord:resourceId>
                        <ord:type>CLI</ord:type>
                    </ord:Resource>
                </ord:Resources>
                <ord:InstallationAddress>
                    <add:AddressSplit>
                        <add:propertyNumber>3303</add:propertyNumber>
                        <add:streetName>DALTON BANK</add:streetName>
                        <add:locality>Sturry</add:locality>
                    </add:AddressSplit>
                    <add:postalTown>NEW MALDEN</add:postalTown>
                    <add:county>Middlesex</add:county>
                    <add:country>UK</add:country>
                    <add:postcode>CV37 7XU</add:postcode>
                </ord:InstallationAddress>
                <ord:ExternalReferences>
                    <ord:ExternalReference>
                        <ord:name>Supplier Order ID</ord:name>
                        <ord:value>M_SUPPLIERORDERID</ord:value>
                    </ord:ExternalReference>
                </ord:ExternalReferences>
                <ord:OrderLines>
                    <ord:OrderLine>
                        <ord:productId>263</ord:productId>
                        <ord:sgoProductType>PACKAGE</ord:sgoProductType>
                        <ord:Attributes>
                            <ord:Attribute>
                                <ord:name>networkResultsReference</ord:name>
                                <ord:value>M_NETWORKRESULTREFERNCE</ord:value>
                            </ord:Attribute>
                        </ord:Attributes>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10609</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10019</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10020</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10021</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10027</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10424</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>11744</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>17205</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10597</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>11738</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10081</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10082</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10086</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10091</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>14021</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>12936</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10757</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>11759</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10144</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>12941</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10238</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10239</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10242</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10243</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>10244</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>11715</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
                    </ord:OrderLine>
                    <ord:OrderLine>
                        <ord:productId>20647</ord:productId>
                        <ord:sgoProductType>PROPOSITION</ord:sgoProductType>
	          <ord:AppointmentDetails>
                     <ord:appointmentId>M_APPTID</ord:appointmentId>
                     <ord:appointmentDate>M_APPDATE</ord:appointmentDate>
                     <ord:appointmentSlotStartTime>M_SLOTSTART</ord:appointmentSlotStartTime>
                     <ord:appointmentSlotEndTime>M_SLOTEND</ord:appointmentSlotEndTime>
                     <ord:contactTelephoneNumber>01235485296</ord:contactTelephoneNumber>
                     <ord:contactName>M_FNAME M_LNAME</ord:contactName>
                     <ord:contactEmailAddress>M_FNAME@autocentral.com</ord:contactEmailAddress>
                     <ord:engineeringNotes>TV ManageSplit</ord:engineeringNotes>
                     </ord:AppointmentDetails>
                  <ord:Attributes>
                       <ord:Attribute>
                        <ord:name>suppressOCC</ord:name>
                        <ord:value>TRUE</ord:value>
                     </ord:Attribute>
                  </ord:Attributes>
                   </ord:OrderLine>
                 </ord:OrderLines>
                <ord:Account>
                    <ord:AccountDetails>
                        <ord:paymentMethod>DIRECT DEBIT</ord:paymentMethod>
                        <ord:DirectDebitDetail>
                            <ord:BankAccount>
                                <ord:bankName>HSBC BANK PLC</ord:bankName>
                                <ord:bankAccountName>M_FNAME M_LNAME</ord:bankAccountName>
                                <ord:bankAccountNumber>31020293</ord:bankAccountNumber>
                                <ord:bankCode>404720</ord:bankCode>
                            </ord:BankAccount>
                        </ord:DirectDebitDetail>
                        <ord:BillingAddress>
                            <add:AddressSplit>
                                <add:propertyNumber>3303</add:propertyNumber>
                                <add:streetName>DALTON BANK</add:streetName>
                                <add:locality>Sturry</add:locality>
                            </add:AddressSplit>
                            <add:postalTown>NEW MALDEN</add:postalTown>
                            <add:county>Middlesex</add:county>
                            <add:country>UK</add:country>
                            <add:postcode>CV37 7XU</add:postcode>
                        </ord:BillingAddress>
                    </ord:AccountDetails>
                    <ord:InvoiceHeader>
                        <ord:invoiceMediaType>EMAIL</ord:invoiceMediaType>
                    </ord:InvoiceHeader>
                </ord:Account>
                <ord:Customer>
                    <ord:CustomerDetails>
                        <ord:title>MR</ord:title>
                        <ord:firstName>M_FNAME</ord:firstName>
                        <ord:lastName>M_LNAME</ord:lastName>
                        <ord:dateOfBirth>1982-02-05</ord:dateOfBirth>
                        <ord:gender>NOT_SPECIFIED</ord:gender>
                        <ord:MarketingPrefDetails>
                            <ord:marketingPrefEmailFlag>true</ord:marketingPrefEmailFlag>
                            <ord:marketingPrefSMSFlag>true</ord:marketingPrefSMSFlag>
                            <ord:marketingPrefLetterFlag>true</ord:marketingPrefLetterFlag>
                            <ord:marketingPrefVoiceFlag>true</ord:marketingPrefVoiceFlag>
                        </ord:MarketingPrefDetails>
                        <ord:EaddressDetails>
                            <ord:EaddressDetail>
                                <ead:emailAddress>M_FNAME@autocentral.com</ead:emailAddress>
                                <ead:emailAddressType>EMAIL</ead:emailAddressType>
                            </ord:EaddressDetail>
                        </ord:EaddressDetails>
                        <ord:Telephones>
                            <ord:Telephone>
                                <tel:telephoneNumber>02600138646</tel:telephoneNumber>
                                <tel:telephoneType>HOME</tel:telephoneType>
                            </ord:Telephone>
                        </ord:Telephones>
                        <ord:CustomerAddress>
                            <add:AddressSplit>
                                <add:propertyNumber>3303</add:propertyNumber>
                                <add:streetName>DALTON BANK</add:streetName>
                                <add:locality>Sturry</add:locality>
                            </add:AddressSplit>
                            <add:postalTown>NEW MALDEN</add:postalTown>
                            <add:county>Middlesex</add:county>
                            <add:country>UK</add:country>
                            <add:postcode>CV37 7XU</add:postcode>
                        </ord:CustomerAddress>
                    </ord:CustomerDetails>
                </ord:Customer>
            </ord:GatewayOrder>
            <ord:correlationId>TVMINSSPTM_CLI</ord:correlationId>
        </ord:SubmitGatewayOrderInputRequest>
    </soapenv:Body>
</soapenv:Envelope>